app/views/patients/show.html.erb

<h3>Meus Eventos</h3>
<% @patient.event_patients.each do |e|%>
---
SELECT  "event_patients".* FROM "event_patients" WHERE "event_patients"."patient_id" = $1 AND "event_patients"."event_id" = $2 LIMIT 1  [["patient_id", 1], ["event_id", 1]]
SELECT "events".* FROM "events" WHERE (events.status_event = 0)