app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "price", "date_start", "date_end", "status_event", "quant_patients", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "name" = $1, "price" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["name", "Gira de atendimento - 18/03/2022"], ["price", 0.0], ["updated_at", "2022-03-17 02:00:28.494338"], ["id", 1]]