app/controllers/event_patients_controller.rb

SELECT "event_patients".* FROM "event_patients"
---
  def index
    @event_patients = EventPatient.all

INSERT INTO "event_patients" ("event_id", "patient_id", "status_event_patient", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["event_id", 1], ["patient_id", 1], ["status_event_patient", 2], ["created_at", "2022-03-17 00:35:53.703438"], ["updated_at", "2022-03-17 00:35:53.703438"]]
---
  def create
    @event_patient = EventPatient.new(event_patient_params)

    respond_to do |format|
      if @event_patient.save

UPDATE "event_patients" SET "status_event_patient" = $1, "updated_at" = $2 WHERE "event_patients"."id" = $3  [["status_event_patient", 2], ["updated_at", "2022-03-17 01:12:33.751599"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @event_patient.update(event_patient_params)

DELETE FROM "event_patients" WHERE "event_patients"."id" = $1  [["id", 2]]
---
  def destroy
    @event_patient.destroy

SELECT  "event_patients".* FROM "event_patients" WHERE "event_patients"."patient_id" = $1 AND "event_patients"."event_id" = $2 LIMIT 1  [["patient_id", 1], ["event_id", 2]]
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_event_patient
      @event_patient = EventPatient.find(params[:id])