app/controllers/patients_controller.rb

  def statistics
    @patients = Patient.all
---
SELECT "patients".* FROM "patients"

  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save
---
INSERT INTO "patients" ("name", "street", "number_address", "neighborhood", "city", "zipcode", "email", "birth_date", "phone", "cell_phone", "job", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"