app/controllers/reminders_controller.rb

SELECT "reminders".* FROM "reminders"
---
  def index
    @reminders = Reminder.all

INSERT INTO "reminders" ("title", "subtitle", "color_title", "color_subtitle", "image", "video", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @reminder = Reminder.new(reminder_params)

    respond_to do |format|
      if @reminder.save

SELECT  "reminders".* FROM "reminders" WHERE "reminders"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_reminder
      @reminder = Reminder.find(params[:id])