app/controllers/scheduling_controller.rb

SELECT  "patients".* FROM "patients" WHERE "patients"."name" = $1 LIMIT 1  [["name", "Rafael Lirio Reis"]]
---
    def index
        unless params[:name].nil?
            name = params[:name]
            @patient = Patient.find_by_name(params[:name])