app/views/layouts/_news.html.erb

<% Reminder.order('id DESC').each do |r|%>
---
SELECT "reminders".* FROM "reminders"  ORDER BY id DESC