app/views/layouts/_studies.html.erb

<% if Study.all.any? %>
---
SELECT COUNT(*) FROM "studies"